In [1]:
import pandas as pd
import sqlite3
import os

db = sqlite3.connect("Titanic.db")

df = pd.read_csv('titanic.csv', header=None)

df.to_sql("Titanic", db, if_exists="replace")

def run_query(query): #This function can be used to insert, select, merge, etc, any data into the created database
    return pd.read_sql_query(query, db)

In [2]:
query = """
SELECT *
FROM sqlite_master
"""

run_query(query)

,type,name,tbl_name,rootpage,sql
0,table,Titanic,Titanic,2,"CREATE TABLE ""Titanic"" (\n""index"" INTEGER,\n ..."
1,index,ix_Titanic_index,Titanic,3,"CREATE INDEX ""ix_Titanic_index""ON ""Titanic"" (""..."

In [3]:
query = """
SELECT *
FROM Titanic
"""

run_query(query)

,index,0,1,2,3,4,5,6,7,8,9,10,11
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,None,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,None,S
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,None,S
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,None,S
887,887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,None,S
889,889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,None,Q

In [4]:
query = """
SELECT
    "1" as "Survived",
    "3" as "Name",
    "4" as "Sex",
    "5" as "Age",
    "8" as "Ticket Number",
    "9" as "Cabin Fare"
FROM Titanic
"""

run_query(query)

,Survived,Name,Sex,Age,Ticket Number,Cabin Fare
0,0,"Braund, Mr. Owen Harris",male,22.0,A/5 21171,7.2500
1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833
2,1,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282,7.9250
3,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803,53.1000
4,0,"Allen, Mr. William Henry",male,35.0,373450,8.0500
...,...,...,...,...,...,...
886,0,"Montvila, Rev. Juozas",male,27.0,211536,13.0000
887,1,"Graham, Miss. Margaret Edith",female,19.0,112053,30.0000
888,0,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,W./C. 6607,23.4500
889,1,"Behr, Mr. Karl Howell",male,26.0,111369,30.0000
890,0,"Dooley, Mr. Patrick",male,32.0,370376,7.7500

In [5]:
query = """
SELECT 
SUM(1) AS Survived,
SUM(9) AS Total_Cabin_Fare,
AVG(9) AS Average_Cabin_Fare
FROM Titanic
"""

run_query(query)

   Survived  Total_Cabin_Fare  Average_Cabin_Fare
0       891              8019                 9.0